Foxcy2611/NCKH_2026_AIOT/AIOT_2026/src/ESP32_MAX30102_Lib.cpp
#include "ESP32_MAX30102_Lib.h"
#include <math.h>
#include <stdio.h>

#if SENSOR_TIMING_DEBUG
#include <esp_timer.h>
#endif

#ifndef MAX30102_ENABLE_BANDPASS_FILTER
#define MAX30102_ENABLE_BANDPASS_FILTER 1
#endif
#ifndef DEBUG_MAX30102_HR
#define DEBUG_MAX30102_HR 1
#endif
#ifndef DEBUG_MAX30102_PEAK
#define DEBUG_MAX30102_PEAK 1
#endif
#if DEBUG_MAX30102_PEAK
#include <stdarg.h>
#include <string.h>
#endif
#define MAX30102_FILTER_FS_HZ 25.0f


/*******************************************************************************
 * Heart-rate and SpO2 algorithm from the Maxim MAXREFDES117 reference design.
 *
 * Copyright (C) 2015 Maxim Integrated Products, Inc., All Rights Reserved.
 * Copyright (C) 2016 Maxim Integrated Products, Inc., All Rights Reserved.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a
 * copy of this software and associated documentation files (the "Software"),
 * to deal in the Software without restriction, including without limitation
 * the rights to use, copy, modify, merge, publish, distribute, sublicense,
 * and/or sell copies of the Software, and to permit persons to whom the
 * Software is furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included
 * in all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS
 * OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING
 * FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER
 * DEALINGS IN THE SOFTWARE.
 ******************************************************************************/

namespace
{
static const int32_t FreqS = 25;
static const int32_t BUFFER_SIZE = FreqS * 4;
static const int32_t MA4_SIZE = 4;
static_assert(BUFFER_SIZE == MAX30102_BUFFER_SIZE, "MAX30102 algorithm requires 100 samples");

static const uint8_t uch_spo2_table[184] = {
    95, 95, 95, 96, 96, 96, 97, 97, 97, 97, 97, 98, 98, 98, 98, 98, 99, 99, 99, 99,
    99, 99, 99, 99, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100,
    100, 100, 100, 100, 99, 99, 99, 99, 99, 99, 99, 99, 98, 98, 98, 98, 98, 98, 97, 97,
    97, 97, 96, 96, 96, 96, 95, 95, 95, 94, 94, 94, 93, 93, 93, 92, 92, 92, 91, 91,
    90, 90, 89, 89, 89, 88, 88, 87, 87, 86, 86, 85, 85, 84, 84, 83, 82, 82, 81, 81,
    80, 80, 79, 78, 78, 77, 76, 76, 75, 74, 74, 73, 72, 72, 71, 70, 69, 69, 68, 67,
    66, 66, 65, 64, 63, 62, 62, 61, 60, 59, 58, 57, 56, 56, 55, 54, 53, 52, 51, 50,
    49, 48, 47, 46, 45, 44, 43, 42, 41, 40, 39, 38, 37, 36, 35, 34, 33, 31, 30, 29,
    28, 27, 26, 25, 23, 22, 21, 20, 19, 17, 16, 15, 14, 12, 11, 10, 9, 7, 6, 5,
    3, 2, 1
};

static int32_t an_x[BUFFER_SIZE];
static int32_t an_y[BUFFER_SIZE];

#if DEBUG_MAX30102_HR || DEBUG_MAX30102_PEAK
static uint32_t MAX30102_hrWindowIndex = 0;
#endif

#if DEBUG_MAX30102_PEAK
static int32_t MAX30102_debugDc[BUFFER_SIZE];
static int32_t MAX30102_debugMa4[BUFFER_SIZE];
static int32_t MAX30102_debugCandidateLocs[15];
static int32_t MAX30102_debugCandidateCount = 0;
static uint32_t MAX30102_debugSession = 0;
static uint32_t MAX30102_debugSessionWindow = 0;
static char MAX30102_debugLine[512];
#endif

#if SENSOR_TIMING_DEBUG
static MAX30102_TimingProfile MAX30102_timingProfile = {};
#endif

/* =========================================================
 * BANDPASS 0.5 Hz - 4 Hz CHỈ DÙNG CHO PEAK DETECTION
 * ========================================================= */

struct MAX30102_BiquadState
{
    float x1;
    float x2;
    float y1;
    float y2;
};

static float MAX30102_BiquadProcess(
    MAX30102_BiquadState *state,
    const float coeffs[5],
    float input
)
{
    float output =
        coeffs[0] * input +
        coeffs[1] * state->x1 +
        coeffs[2] * state->x2 -
        coeffs[3] * state->y1 -
        coeffs[4] * state->y2;

    state->x2 = state->x1;
    state->x1 = input;
    state->y2 = state->y1;
    state->y1 = output;

    return output;
}

static void MAX30102_BandpassFilter(int32_t *data, int32_t length)
{
    const float q = 0.707107f;
    const float pi = static_cast<float>(PI);

    float omega = 2.0f * pi * 0.5f / MAX30102_FILTER_FS_HZ;
    float alpha = sinf(omega) / (2.0f * q);
    float cosOmega = cosf(omega);
    float a0 = 1.0f + alpha;
    float highpassCoeffs[5] = {
        (1.0f + cosOmega) / 2.0f,
        -(1.0f + cosOmega),
        (1.0f + cosOmega) / 2.0f,
        -2.0f * cosOmega,
        1.0f - alpha
    };

    for (uint8_t i = 0; i < 5; i++)
    {
        highpassCoeffs[i] /= a0;
    }

    omega = 2.0f * pi * 4.0f / MAX30102_FILTER_FS_HZ;
    alpha = sinf(omega) / (2.0f * q);
    cosOmega = cosf(omega);
    a0 = 1.0f + alpha;
    float lowpassCoeffs[5] = {
        (1.0f - cosOmega) / 2.0f,
        1.0f - cosOmega,
        (1.0f - cosOmega) / 2.0f,
        -2.0f * cosOmega,
        1.0f - alpha
    };

    for (uint8_t i = 0; i < 5; i++)
    {
        lowpassCoeffs[i] /= a0;
    }

    /* Reset state cho từng buffer 100 mẫu. */
    MAX30102_BiquadState highpassState = {};
    MAX30102_BiquadState lowpassState = {};

    for (int32_t i = 0; i < length; i++)
    {
        float highpassOutput = MAX30102_BiquadProcess(
            &highpassState,
            highpassCoeffs,
            static_cast<float>(data[i])
        );
        float bandpassOutput = MAX30102_BiquadProcess(
            &lowpassState,
            lowpassCoeffs,
            highpassOutput
        );

        data[i] = static_cast<int32_t>(lroundf(bandpassOutput));
    }
}

static void maxim_find_peaks(
    int32_t *pn_locs,
    int32_t *n_npks,
    int32_t *pn_x,
    int32_t n_size,
    int32_t n_min_height,
    int32_t n_min_distance,
    int32_t n_max_num
);

