Foxcy2611/NCKH_2026_AIOT/AIOT_2026/src/ESP32_MAX30102_Lib.cpp
static void maxim_peaks_above_min_height(
    int32_t *pn_locs,
    int32_t *n_npks,
    int32_t *pn_x,
    int32_t n_size,
    int32_t n_min_height
);

static void maxim_remove_close_peaks(
    int32_t *pn_locs,
    int32_t *pn_npks,
    int32_t *pn_x,
    int32_t n_min_distance
);

static void maxim_sort_ascend(int32_t *pn_x, int32_t n_size);

static void maxim_sort_indices_descend(
    int32_t *pn_x,
    int32_t *pn_indx,
    int32_t n_size
);

#if DEBUG_MAX30102_PEAK
static void MAX30102_DebugLogSuspiciousWindow(
    uint32_t windowIndex,
    uint32_t session,
    uint32_t sessionWindow,
    int32_t *finalPeaks,
    int32_t finalPeakCount,
    int32_t thresholdMean,
    int32_t threshold
);
#endif

static void maxim_heart_rate_and_oxygen_saturation(
    uint32_t *pun_ir_buffer,
    int32_t n_ir_buffer_length,
    uint32_t *pun_red_buffer,
    int32_t *pn_spo2,
    int8_t *pch_spo2_valid,
    int32_t *pn_heart_rate,
    int8_t *pch_hr_valid
)
{
#if SENSOR_TIMING_DEBUG
    int64_t phaseStartUs = esp_timer_get_time();
#endif

    uint32_t un_ir_mean;
    int32_t k;
    int32_t n_i_ratio_count;
    int32_t i;
    int32_t n_exact_ir_valley_locs_count;
    int32_t n_middle_idx;
    int32_t n_th1;
    int32_t n_npks;
    int32_t an_ir_valley_locs[15];
    int32_t n_peak_interval_sum;
    int32_t n_y_ac;
    int32_t n_x_ac;
    int32_t n_spo2_calc;
    int32_t n_y_dc_max;
    int32_t n_x_dc_max;
    int32_t n_y_dc_max_idx = 0;
    int32_t n_x_dc_max_idx = 0;
    int32_t an_ratio[5];
    int32_t n_ratio_average;
    int32_t n_nume;
    int32_t n_denom;
    float averagePeakInterval = 0.0f;
    float calculatedHeartRate = -999.0f;
    int32_t legacyHeartRate = -999;

    un_ir_mean = 0;
    for (k = 0; k < n_ir_buffer_length; k++)
    {
        un_ir_mean += pun_ir_buffer[k];
    }
    un_ir_mean = un_ir_mean / n_ir_buffer_length;

    for (k = 0; k < n_ir_buffer_length; k++)
    {
        an_x[k] = -1 * (pun_ir_buffer[k] - un_ir_mean);
    }

#if DEBUG_MAX30102_PEAK
    memcpy(MAX30102_debugDc, an_x, sizeof(MAX30102_debugDc));
#endif

    for (k = 0; k < BUFFER_SIZE - MA4_SIZE; k++)
    {
        an_x[k] = (an_x[k] + an_x[k + 1] + an_x[k + 2] + an_x[k + 3]) / 4;
    }

#if DEBUG_MAX30102_PEAK
    memcpy(MAX30102_debugMa4, an_x, sizeof(MAX30102_debugMa4));
#endif

#if MAX30102_ENABLE_BANDPASS_FILTER
    /* Chỉ lọc bản sao an_x, không sửa dữ liệu IR/RED gốc. */
    MAX30102_BandpassFilter(an_x, n_ir_buffer_length);
#endif

#if SENSOR_TIMING_DEBUG
    MAX30102_timingProfile.filterUs =
        esp_timer_get_time() - phaseStartUs;
    phaseStartUs = esp_timer_get_time();
#endif

    n_th1 = 0;
    for (k = 0; k < BUFFER_SIZE; k++)
    {
        n_th1 += an_x[k];
    }
    n_th1 = n_th1 / BUFFER_SIZE;
#if DEBUG_MAX30102_PEAK
    const int32_t debugThresholdMean = n_th1;
#endif
    if (n_th1 < 30)
    {
        n_th1 = 30;
    }
    if (n_th1 > 60)
    {
        n_th1 = 60;
    }

    for (k = 0; k < 15; k++)
    {
        an_ir_valley_locs[k] = 0;
    }

    maxim_find_peaks(
        an_ir_valley_locs,
        &n_npks,
        an_x,
        BUFFER_SIZE,
        n_th1,
        4,
        15
    );

    n_peak_interval_sum = 0;
    if (n_npks >= 2)
    {
        for (k = 1; k < n_npks; k++)
        {
            n_peak_interval_sum += an_ir_valley_locs[k] - an_ir_valley_locs[k - 1];
        }

        int32_t intervalCount = n_npks - 1;
        int32_t legacyAverageInterval =
            n_peak_interval_sum / intervalCount;
        legacyHeartRate =
            (FreqS * 60) / legacyAverageInterval;

        averagePeakInterval =
            static_cast<float>(n_peak_interval_sum) / intervalCount;
        calculatedHeartRate =
            (FreqS * 60.0f) / averagePeakInterval;
        *pn_heart_rate = static_cast<int32_t>(lroundf(calculatedHeartRate));
        *pch_hr_valid = 1;
    }
    else
    {
        *pn_heart_rate = -999;
        *pch_hr_valid = 0;
    }

#if SENSOR_TIMING_DEBUG
    MAX30102_timingProfile.bpmUs =
        esp_timer_get_time() - phaseStartUs;
#endif

#if DEBUG_MAX30102_HR || DEBUG_MAX30102_PEAK
    const uint32_t debugWindowIndex = ++MAX30102_hrWindowIndex;
#endif

#if DEBUG_MAX30102_PEAK
    const uint32_t debugSession = MAX30102_debugSession;
    const uint32_t debugSessionWindow = ++MAX30102_debugSessionWindow;
#endif

#if DEBUG_MAX30102_HR
    char hrDebugLine[320];
    int debugLength = snprintf(
        hrDebugLine,
        sizeof(hrDebugLine),
        "[MAX-HR] window=%lu peaks=%ld locs=",
        (unsigned long)debugWindowIndex,
        (long)n_npks
    );

    for (k = 0; k < n_npks; k++)
    {
        debugLength += snprintf(
            hrDebugLine + debugLength,
            sizeof(hrDebugLine) - debugLength,
            "%s%ld",
            k == 0 ? "" : ",",
            (long)an_ir_valley_locs[k]
        );
    }

    debugLength += snprintf(
        hrDebugLine + debugLength,
        sizeof(hrDebugLine) - debugLength,
        " intervals="
    );
    for (k = 1; k < n_npks; k++)
    {
        debugLength += snprintf(
            hrDebugLine + debugLength,
            sizeof(hrDebugLine) - debugLength,
            "%s%ld",
            k == 1 ? "" : ",",
            (long)(an_ir_valley_locs[k] - an_ir_valley_locs[k - 1])
        );
    }

    snprintf(
        hrDebugLine + debugLength,
        sizeof(hrDebugLine) - debugLength,
        " total=%ld avg=%.2f hr=%.2f out=%ld legacy=%ld",
        (long)n_peak_interval_sum,
        averagePeakInterval,
        calculatedHeartRate,
        (long)*pn_heart_rate,
        (long)legacyHeartRate
    );
    Serial.println(hrDebugLine);
#endif

#if DEBUG_MAX30102_PEAK
    MAX30102_DebugLogSuspiciousWindow(
        debugWindowIndex,
        debugSession,
        debugSessionWindow,
        an_ir_valley_locs,
        n_npks,
        debugThresholdMean,
        n_th1
    );
#endif

#if SENSOR_TIMING_DEBUG
    phaseStartUs = esp_timer_get_time();
#endif

    for (k = 0; k < n_ir_buffer_length; k++)
    {
        an_x[k] = pun_ir_buffer[k];
        an_y[k] = pun_red_buffer[k];
    }

    n_exact_ir_valley_locs_count = n_npks;
    n_ratio_average = 0;
    n_i_ratio_count = 0;
    for (k = 0; k < 5; k++)
    {
        an_ratio[k] = 0;
    }

