Foxcy2611/NCKH_2026_AIOT/AIOT_2026/src/ESP32_MAX30102_Lib.cpp
    for (k = 0; k < n_exact_ir_valley_locs_count; k++)
    {
        if (an_ir_valley_locs[k] > BUFFER_SIZE)
        {
            *pn_spo2 = -999;
            *pch_spo2_valid = 0;
#if SENSOR_TIMING_DEBUG
            MAX30102_timingProfile.spo2Us =
                esp_timer_get_time() - phaseStartUs;
#endif
            return;
        }
    }

    for (k = 0; k < n_exact_ir_valley_locs_count - 1; k++)
    {
        n_y_dc_max = -16777216;
        n_x_dc_max = -16777216;

        if (an_ir_valley_locs[k + 1] - an_ir_valley_locs[k] > 3)
        {
            for (i = an_ir_valley_locs[k]; i < an_ir_valley_locs[k + 1]; i++)
            {
                if (an_x[i] > n_x_dc_max)
                {
                    n_x_dc_max = an_x[i];
                    n_x_dc_max_idx = i;
                }
                if (an_y[i] > n_y_dc_max)
                {
                    n_y_dc_max = an_y[i];
                    n_y_dc_max_idx = i;
                }
            }

            n_y_ac =
                (an_y[an_ir_valley_locs[k + 1]] - an_y[an_ir_valley_locs[k]]) *
                (n_y_dc_max_idx - an_ir_valley_locs[k]);
            n_y_ac =
                an_y[an_ir_valley_locs[k]] +
                n_y_ac / (an_ir_valley_locs[k + 1] - an_ir_valley_locs[k]);
            n_y_ac = an_y[n_y_dc_max_idx] - n_y_ac;

            n_x_ac =
                (an_x[an_ir_valley_locs[k + 1]] - an_x[an_ir_valley_locs[k]]) *
                (n_x_dc_max_idx - an_ir_valley_locs[k]);
            n_x_ac =
                an_x[an_ir_valley_locs[k]] +
                n_x_ac / (an_ir_valley_locs[k + 1] - an_ir_valley_locs[k]);
            n_x_ac = an_x[n_y_dc_max_idx] - n_x_ac;

            n_nume = (n_y_ac * n_x_dc_max) >> 7;
            n_denom = (n_x_ac * n_y_dc_max) >> 7;

            if (n_denom > 0 && n_i_ratio_count < 5 && n_nume != 0)
            {
                an_ratio[n_i_ratio_count] = (n_nume * 100) / n_denom;
                n_i_ratio_count++;
            }
        }
    }

    maxim_sort_ascend(an_ratio, n_i_ratio_count);
    n_middle_idx = n_i_ratio_count / 2;

    if (n_middle_idx > 1)
    {
        n_ratio_average =
            (an_ratio[n_middle_idx - 1] + an_ratio[n_middle_idx]) / 2;
    }
    else
    {
        n_ratio_average = an_ratio[n_middle_idx];
    }

    if (n_ratio_average > 2 && n_ratio_average < 184)
    {
        n_spo2_calc = uch_spo2_table[n_ratio_average];
        *pn_spo2 = n_spo2_calc;
        *pch_spo2_valid = 1;
    }
    else
    {
        *pn_spo2 = -999;
        *pch_spo2_valid = 0;
    }


#if SENSOR_TIMING_DEBUG
    MAX30102_timingProfile.spo2Us =
        esp_timer_get_time() - phaseStartUs;
#endif
}

static void maxim_find_peaks(
    int32_t *pn_locs,
    int32_t *n_npks,
    int32_t *pn_x,
    int32_t n_size,
    int32_t n_min_height,
    int32_t n_min_distance,
    int32_t n_max_num
)
{
    maxim_peaks_above_min_height(
        pn_locs,
        n_npks,
        pn_x,
        n_size,
        n_min_height
    );
#if DEBUG_MAX30102_PEAK
    MAX30102_debugCandidateCount = *n_npks;
    for (int32_t i = 0; i < MAX30102_debugCandidateCount; i++)
    {
        MAX30102_debugCandidateLocs[i] = pn_locs[i];
    }
#endif
    maxim_remove_close_peaks(pn_locs, n_npks, pn_x, n_min_distance);
    *n_npks = min(*n_npks, n_max_num);
}

static void maxim_peaks_above_min_height(
    int32_t *pn_locs,
    int32_t *n_npks,
    int32_t *pn_x,
    int32_t n_size,
    int32_t n_min_height
)
{
    int32_t i = 1;
    int32_t n_width;

    *n_npks = 0;
    while (i < n_size - 1)
    {
        if (pn_x[i] > n_min_height && pn_x[i] > pn_x[i - 1])
        {
            n_width = 1;
            while (i + n_width < n_size && pn_x[i] == pn_x[i + n_width])
            {
                n_width++;
            }

            if (
                i + n_width < n_size &&
                pn_x[i] > pn_x[i + n_width] &&
                *n_npks < 15
            )
            {
                pn_locs[(*n_npks)++] = i;
                i += n_width + 1;
            }
            else
            {
                i += n_width;
            }
        }
        else
        {
            i++;
        }
    }
}

static void maxim_remove_close_peaks(
    int32_t *pn_locs,
    int32_t *pn_npks,
    int32_t *pn_x,
    int32_t n_min_distance
)
{
    int32_t i;
    int32_t j;
    int32_t n_old_npks;
    int32_t n_dist;

    maxim_sort_indices_descend(pn_x, pn_locs, *pn_npks);

    for (i = -1; i < *pn_npks; i++)
    {
        n_old_npks = *pn_npks;
        *pn_npks = i + 1;

        for (j = i + 1; j < n_old_npks; j++)
        {
            n_dist = pn_locs[j] - (i == -1 ? -1 : pn_locs[i]);
            if (n_dist > n_min_distance || n_dist < -n_min_distance)
            {
                pn_locs[(*pn_npks)++] = pn_locs[j];
            }
        }
    }

    maxim_sort_ascend(pn_locs, *pn_npks);
}

static void maxim_sort_ascend(int32_t *pn_x, int32_t n_size)
{
    int32_t i;
    int32_t j;
    int32_t n_temp;

    for (i = 1; i < n_size; i++)
    {
        n_temp = pn_x[i];
        for (j = i; j > 0 && n_temp < pn_x[j - 1]; j--)
        {
            pn_x[j] = pn_x[j - 1];
        }
        pn_x[j] = n_temp;
    }
}

static void maxim_sort_indices_descend(
    int32_t *pn_x,
    int32_t *pn_indx,
    int32_t n_size
)
{
    int32_t i;
    int32_t j;
    int32_t n_temp;

    for (i = 1; i < n_size; i++)
    {
        n_temp = pn_indx[i];
        for (
            j = i;
            j > 0 && pn_x[n_temp] > pn_x[pn_indx[j - 1]];
            j--
        )
        {
            pn_indx[j] = pn_indx[j - 1];
        }
        pn_indx[j] = n_temp;
    }
}

#if DEBUG_MAX30102_PEAK
static size_t MAX30102_DebugAppend(
    char *line,
    size_t capacity,
    size_t length,
    const char *format,
    ...
)
{
    if (length >= capacity)
    {
        return capacity - 1;
    }

    va_list arguments;
    va_start(arguments, format);
    int written = vsnprintf(
        line + length,
        capacity - length,
        format,
        arguments
    );
    va_end(arguments);

    if (written < 0)
    {
        return length;
    }

