Foxcy2611/NCKH_2026_AIOT/AIOT_2026/src/ESP32_MAX30102_Lib.cpp
    size_t available = capacity - length;
    if (static_cast<size_t>(written) >= available)
    {
        return capacity - 1;
    }

    return length + static_cast<size_t>(written);
}

static bool MAX30102_DebugPeakIsKept(
    int32_t peak,
    int32_t *finalPeaks,
    int32_t finalPeakCount
)
{
    for (int32_t i = 0; i < finalPeakCount; i++)
    {
        if (finalPeaks[i] == peak)
        {
            return true;
        }
    }

    return false;
}

static int32_t MAX30102_DebugLocalProminence(int32_t peak)
{
    if (peak <= 0 || peak >= BUFFER_SIZE - 1)
    {
        return 0;
    }

    int32_t leftStart = peak > 3 ? peak - 3 : 0;
    int32_t rightEnd = peak + 3 < BUFFER_SIZE ? peak + 3 : BUFFER_SIZE - 1;
    int32_t leftMinimum = an_x[peak - 1];
    int32_t rightMinimum = an_x[peak + 1];

    for (int32_t i = peak - 2; i >= leftStart; i--)
    {
        if (an_x[i] < leftMinimum)
        {
            leftMinimum = an_x[i];
        }
    }

    for (int32_t i = peak + 2; i <= rightEnd; i++)
    {
        if (an_x[i] < rightMinimum)
        {
            rightMinimum = an_x[i];
        }
    }

    int32_t localBase = leftMinimum > rightMinimum
        ? leftMinimum
        : rightMinimum;
    return an_x[peak] - localBase;
}

static void MAX30102_DebugLogSuspiciousWindow(
    uint32_t windowIndex,
    uint32_t session,
    uint32_t sessionWindow,
    int32_t *finalPeaks,
    int32_t finalPeakCount,
    int32_t thresholdMean,
    int32_t threshold
)
{
    bool suspiciousWindow = false;

    for (int32_t i = 1; i < finalPeakCount; i++)
    {
        int32_t interval = finalPeaks[i] - finalPeaks[i - 1];
        if (interval <= 10 || interval >= 25)
        {
            suspiciousWindow = true;
            break;
        }
    }

    if (!suspiciousWindow)
    {
        for (int32_t i = 0; i < finalPeakCount; i++)
        {
            if (finalPeaks[i] >= 94)
            {
                suspiciousWindow = true;
                break;
            }
        }
    }

    if (!suspiciousWindow)
    {
        return;
    }

    size_t length = MAX30102_DebugAppend(
        MAX30102_debugLine,
        sizeof(MAX30102_debugLine),
        0,
        "[MAX-P] window=%lu session=%lu session_window=%lu mean=%ld threshold=%ld candidates=",
        (unsigned long)windowIndex,
        (unsigned long)session,
        (unsigned long)sessionWindow,
        (long)thresholdMean,
        (long)threshold
    );

    if (MAX30102_debugCandidateCount == 0)
    {
        length = MAX30102_DebugAppend(
            MAX30102_debugLine,
            sizeof(MAX30102_debugLine),
            length,
            "none"
        );
    }
    else
    {
        for (int32_t i = 0; i < MAX30102_debugCandidateCount; i++)
        {
            int32_t peak = MAX30102_debugCandidateLocs[i];
            bool kept = MAX30102_DebugPeakIsKept(
                peak,
                finalPeaks,
                finalPeakCount
            );
            length = MAX30102_DebugAppend(
                MAX30102_debugLine,
                sizeof(MAX30102_debugLine),
                length,
                "%s%ld:%ld:%c",
                i == 0 ? "" : ",",
                (long)peak,
                (long)an_x[peak],
                kept ? 'K' : 'R'
            );
        }
    }

    length = MAX30102_DebugAppend(
        MAX30102_debugLine,
        sizeof(MAX30102_debugLine),
        length,
        " kept="
    );
    if (finalPeakCount == 0)
    {
        MAX30102_DebugAppend(
            MAX30102_debugLine,
            sizeof(MAX30102_debugLine),
            length,
            "none"
        );
    }
    else
    {
        for (int32_t i = 0; i < finalPeakCount; i++)
        {
            length = MAX30102_DebugAppend(
                MAX30102_debugLine,
                sizeof(MAX30102_debugLine),
                length,
                "%s%ld",
                i == 0 ? "" : ",",
                (long)finalPeaks[i]
            );
        }
    }
    Serial.println(MAX30102_debugLine);

    for (int32_t i = 0; i < MAX30102_debugCandidateCount; i++)
    {
        int32_t peak = MAX30102_debugCandidateLocs[i];
        if (peak > 3)
        {
            continue;
        }

        bool kept = MAX30102_DebugPeakIsKept(
            peak,
            finalPeaks,
            finalPeakCount
        );
        snprintf(
            MAX30102_debugLine,
            sizeof(MAX30102_debugLine),
            "[MAX-DIST] window=%lu session=%lu a=-1 amp=NA b=%ld amp=%ld distance=%ld result=%s",
            (unsigned long)windowIndex,
            (unsigned long)session,
            (long)peak,
            (long)an_x[peak],
            (long)(peak + 1),
            kept ? "KEEP_B" : "REMOVE_B"
        );
        Serial.println(MAX30102_debugLine);
    }

    for (int32_t i = 1; i < MAX30102_debugCandidateCount; i++)
    {
        int32_t peakA = MAX30102_debugCandidateLocs[i - 1];
        int32_t peakB = MAX30102_debugCandidateLocs[i];
        int32_t distance = peakB - peakA;
        if (distance > 10)
        {
            continue;
        }

        bool keepA = MAX30102_DebugPeakIsKept(
            peakA,
            finalPeaks,
            finalPeakCount
        );
        bool keepB = MAX30102_DebugPeakIsKept(
            peakB,
            finalPeaks,
            finalPeakCount
        );
        const char *result = keepA
            ? (keepB ? "KEEP_BOTH" : "REMOVE_B")
            : (keepB ? "REMOVE_A" : "REMOVE_BOTH");

        snprintf(
            MAX30102_debugLine,
            sizeof(MAX30102_debugLine),
            "[MAX-DIST] window=%lu session=%lu a=%ld amp=%ld b=%ld amp=%ld distance=%ld result=%s",
            (unsigned long)windowIndex,
            (unsigned long)session,
            (long)peakA,
            (long)an_x[peakA],
            (long)peakB,
            (long)an_x[peakB],
            (long)distance,
            result
        );
        Serial.println(MAX30102_debugLine);
    }

    for (int32_t i = 0; i < finalPeakCount; i++)
    {
        int32_t peak = finalPeaks[i];
        int32_t previousPeak = i > 0 ? finalPeaks[i - 1] : -1;
        int32_t nextPeak = i + 1 < finalPeakCount ? finalPeaks[i + 1] : -1;
        int32_t previousDistance = previousPeak >= 0 ? peak - previousPeak : -1;
        int32_t nextDistance = nextPeak >= 0 ? nextPeak - peak : -1;
        bool suspiciousPrevious =
            previousDistance >= 0 &&
            (previousDistance <= 10 || previousDistance >= 25);
        bool suspiciousNext =
            nextDistance >= 0 &&
            (nextDistance <= 10 || nextDistance >= 25);

        if (peak < 94 && !suspiciousPrevious && !suspiciousNext)
        {
            continue;
        }

        uint32_t absoluteSample =
            (sessionWindow - 1) * MAX30102_NEW_SAMPLES + peak;
        int32_t prominence = MAX30102_DebugLocalProminence(peak);
        snprintf(
            MAX30102_debugLine,
            sizeof(MAX30102_debugLine),
            "[MAX-PEAK] window=%lu session=%lu session_window=%lu peak=%ld abs=%lu prev=%ld next=%ld dprev=%ld dnext=%ld edge_start=%ld edge_end=%ld amp=%ld threshold=%ld prominence=%ld",
            (unsigned long)windowIndex,
            (unsigned long)session,
            (unsigned long)sessionWindow,
            (long)peak,
            (unsigned long)absoluteSample,
            (long)previousPeak,
            (long)nextPeak,
            (long)previousDistance,
            (long)nextDistance,
            (long)peak,
            (long)(BUFFER_SIZE - 1 - peak),
            (long)an_x[peak],
            (long)threshold,
            (long)prominence
        );
        Serial.println(MAX30102_debugLine);

        int32_t rangeStart = peak > 3 ? peak - 3 : 0;
        int32_t rangeEnd = peak + 3 < BUFFER_SIZE ? peak + 3 : BUFFER_SIZE - 1;
        length = MAX30102_DebugAppend(
            MAX30102_debugLine,
            sizeof(MAX30102_debugLine),
            0,
            "[MAX-SIG] window=%lu session=%lu peak=%ld abs=%lu range=%ld..%ld DC=",
            (unsigned long)windowIndex,
            (unsigned long)session,
            (long)peak,
            (unsigned long)absoluteSample,
            (long)rangeStart,
            (long)rangeEnd
        );
        for (int32_t sample = rangeStart; sample <= rangeEnd; sample++)
        {
            length = MAX30102_DebugAppend(
                MAX30102_debugLine,
                sizeof(MAX30102_debugLine),
                length,
                "%s%ld",
                sample == rangeStart ? "" : ",",
                (long)MAX30102_debugDc[sample]
            );
        }
        length = MAX30102_DebugAppend(
            MAX30102_debugLine,
            sizeof(MAX30102_debugLine),
            length,
            " MA4="
        );
        for (int32_t sample = rangeStart; sample <= rangeEnd; sample++)
        {
            length = MAX30102_DebugAppend(
                MAX30102_debugLine,
                sizeof(MAX30102_debugLine),
                length,
                "%s%ld",
                sample == rangeStart ? "" : ",",
                (long)MAX30102_debugMa4[sample]
            );
        }
        length = MAX30102_DebugAppend(
            MAX30102_debugLine,
            sizeof(MAX30102_debugLine),
            length,
            " BP="
        );
        for (int32_t sample = rangeStart; sample <= rangeEnd; sample++)
        {
            length = MAX30102_DebugAppend(
                MAX30102_debugLine,
                sizeof(MAX30102_debugLine),
                length,
                "%s%ld",
                sample == rangeStart ? "" : ",",
                (long)an_x[sample]
            );
        }
        Serial.println(MAX30102_debugLine);

        if (peak < 94)
        {
            continue;
        }

        length = MAX30102_DebugAppend(
            MAX30102_debugLine,
            sizeof(MAX30102_debugLine),
            0,
            "[MAX-TAIL] window=%lu session=%lu peak=%ld DC[93..99]=",
            (unsigned long)windowIndex,
            (unsigned long)session,
            (long)peak
        );
        for (int32_t sample = 93; sample < BUFFER_SIZE; sample++)
        {
            length = MAX30102_DebugAppend(
                MAX30102_debugLine,
                sizeof(MAX30102_debugLine),
                length,
                "%s%ld",
                sample == 93 ? "" : ",",
                (long)MAX30102_debugDc[sample]
            );
        }
        length = MAX30102_DebugAppend(
            MAX30102_debugLine,
            sizeof(MAX30102_debugLine),
            length,
            " MA4[93..99]="
        );
        for (int32_t sample = 93; sample < BUFFER_SIZE; sample++)
        {
            length = MAX30102_DebugAppend(
                MAX30102_debugLine,
                sizeof(MAX30102_debugLine),
                length,
                "%s%ld",
                sample == 93 ? "" : ",",
                (long)MAX30102_debugMa4[sample]
            );
        }
        length = MAX30102_DebugAppend(
            MAX30102_debugLine,
            sizeof(MAX30102_debugLine),
            length,
            " BP[93..99]="
        );
        for (int32_t sample = 93; sample < BUFFER_SIZE; sample++)
        {
            length = MAX30102_DebugAppend(
                MAX30102_debugLine,
                sizeof(MAX30102_debugLine),
                length,
                "%s%ld",
                sample == 93 ? "" : ",",
                (long)an_x[sample]
            );
        }
        Serial.println(MAX30102_debugLine);
    }
}
#endif
}


/* =========================================================
 * INTERRUPT FLAG
 * ========================================================= */

