Foxcy2611/NCKH_2026_AIOT/AIOT_2026/src/ESP32_MAX30102_Lib.cpp
volatile bool MAX30102_is_ready = false;


/* =========================================================
 * INTERNAL FUNCTION PROTOTYPES
 * ========================================================= */

static bool MAX30102_WriteReg(
    uint8_t reg,
    uint8_t value
);

static bool MAX30102_ReadReg(
    uint8_t reg,
    uint8_t *value
);

static uint8_t MAX30102_I2CPing(void);
static uint32_t MAX30102_irBuffer[MAX30102_BUFFER_SIZE];
static uint32_t MAX30102_redBuffer[MAX30102_BUFFER_SIZE];

static bool MAX30102_bufferReady = false;
static const uint32_t MAX30102_SAMPLE_TIMEOUT_MS = 6000;
static SemaphoreHandle_t MAX30102_i2cMutex = nullptr;


static bool MAX30102_IsFingerDetected(uint32_t irSample)
{
    return irSample > MAX30102_IR_FINGER_THRESHOLD;
}


static void MAX30102_ApplyPhysiologicalSanityCheck(
    int32_t *heartRate,
    int8_t *validHeartRate,
    int32_t *spo2,
    int8_t *validSpO2
)
{
    if (
        *validHeartRate &&
        (*heartRate < MAX30102_HR_MIN_BPM ||
         *heartRate > MAX30102_HR_MAX_BPM)
    )
    {
        *validHeartRate = 0;
    }

    if (
        *validSpO2 &&
        (*spo2 < MAX30102_SPO2_MIN_PCT ||
         *spo2 > MAX30102_SPO2_MAX_PCT)
    )
    {
        *validSpO2 = 0;
    }
}


static bool MAX30102_LockI2C(void)
{
    return MAX30102_i2cMutex == nullptr ||
           xSemaphoreTake(MAX30102_i2cMutex, portMAX_DELAY) == pdTRUE;
}


static void MAX30102_UnlockI2C(void)
{
    if (MAX30102_i2cMutex != nullptr)
    {
        xSemaphoreGive(MAX30102_i2cMutex);
    }
}


/* =========================================================
 * I2C PING
 *
 * Chỉ kiểm tra xem thiết bị địa chỉ 0x57 có ACK hay không.
 * ========================================================= */

static uint8_t MAX30102_I2CPing(void)
{
    Wire.beginTransmission(MAX30102_ADDR_REG);

    return Wire.endTransmission();
}


/* =========================================================
 * WRITE REGISTER
 * ========================================================= */

static bool MAX30102_WriteReg(
    uint8_t reg,
    uint8_t value
)
{
    Wire.beginTransmission(MAX30102_ADDR_REG);

    Wire.write(reg);
    Wire.write(value);


    uint8_t error = Wire.endTransmission();


    if (error != 0)
    {
        return false;
    }


    return true;
}


/* =========================================================
 * READ REGISTER
 * ========================================================= */

static bool MAX30102_ReadReg(
    uint8_t reg,
    uint8_t *value
)
{
    if (value == nullptr)
    {
        return false;
    }


    /* -----------------------------------------------------
     * Gửi địa chỉ register muốn đọc
     * ----------------------------------------------------- */

    Wire.beginTransmission(MAX30102_ADDR_REG);

    Wire.write(reg);


    /*
     * false:
     *
     * Không STOP.
     * Sau đó Wire.requestFrom() sẽ tạo
     * REPEATED START.
     */
    uint8_t error =
        Wire.endTransmission(false);


    if (error != 0)
    {
        return false;
    }


    /* -----------------------------------------------------
     * Đọc 1 byte
     * ----------------------------------------------------- */

    size_t received =
        Wire.requestFrom(
            (uint8_t)MAX30102_ADDR_REG,
            (size_t)1,
            true
        );


    if (received != 1)
    {
        return false;
    }


    if (!Wire.available())
    {
        return false;
    }


    *value = Wire.read();


    return true;
}


/* =========================================================
 * INITIALIZE MAX30102
 * ========================================================= */

void MAX30102_SetI2CMutex(SemaphoreHandle_t mutex)
{
    MAX30102_i2cMutex = mutex;
}


#if SENSOR_TIMING_DEBUG
void MAX30102_GetTimingProfile(MAX30102_TimingProfile *profile)
{
    if (profile != nullptr)
    {
        *profile = MAX30102_timingProfile;
    }
}
#endif


bool MAX30102_Init(void)
{
    uint8_t configValue = 0;
    uint8_t registerValue = 0;

    MAX30102_is_ready = false;
    MAX30102_bufferReady = false;


    /* =====================================================
     * 1. CONFIG INT PIN
     * ===================================================== */

    pinMode(INT_PIN, INPUT_PULLUP);


    /* =====================================================
     * 2. CHECK PART ID
     * ===================================================== */

    if (!MAX30102_ReadReg(
            REG_PART_ID,
            &registerValue))
    {
        return false;
    }


    if (registerValue != VALUE_PART_ID)
    {
        return false;
    }


    /* =====================================================
     * 3. RESET
     * ===================================================== */

    if (!MAX30102_WriteReg(
            REG_MODE_CONFIG,
            MODE_RESET))
    {
        return false;
    }


    /*
     * Cho MAX30102 tự clear bit RESET.
     */
    uint32_t resetStart = millis();


    while (1)
    {
        if (!MAX30102_ReadReg(
                REG_MODE_CONFIG,
                &registerValue))
        {
            return false;
        }


        if ((registerValue & MODE_RESET) == 0)
        {
            break;
        }


        if ((millis() - resetStart) > 100)
        {
            return false;
        }


        delay(1);
    }


    /* =====================================================
     * 4. DISABLE INTERRUPTS
     * ===================================================== */

    if (!MAX30102_WriteReg(
            REG_INTER_ENABLE_1,
            0x00))
    {
        return false;
    }


    if (!MAX30102_WriteReg(
            REG_INTER_ENABLE_2,
            0x00))
    {
        return false;
    }


    /* =====================================================
     * 5. RESET FIFO POINTERS
     * ===================================================== */

    if (!MAX30102_WriteReg(
            REG_WR_PTR_CONF,
            ERASER_POINTER))
    {
        return false;
    }


    if (!MAX30102_WriteReg(
            REG_OVF_COUNTER,
            ERASER_POINTER))
    {
        return false;
    }


