Foxcy2611/NCKH_2026_AIOT/AIOT_2026/src/ESP32_MAX30102_Lib.cpp
    if (!MAX30102_WriteReg(
            REG_RD_PTR_CONF,
            ERASER_POINTER))
    {
        return false;
    }


    /* =====================================================
     * 6. FIFO CONFIG
     *
     * Average 4
     * Rollover enable
     * Almost Full threshold
     * ===================================================== */

    configValue =
        FIFO_SMP_AVE_4 |
        FIFO_ROLLOVER_ENABLE |
        FIFO_A_FULL_15;


    if (!MAX30102_WriteReg(
            REG_FIFO_CONFIG,
            configValue))
    {
        return false;
    }


    /* =====================================================
     * 7. SPO2 CONFIG
     *
     * ADC = 4096 nA
     * Sample rate = 100 SPS
     * Pulse width = 411 us
     * ===================================================== */

    configValue =
        SP02_ADC_RGE_4096 |
        SP02_SR_100 |
        SP02_LED_PW_411;


    if (!MAX30102_WriteReg(
            REG_SP02_CONFIG,
            configValue))
    {
        return false;
    }


    /* =====================================================
     * 8. LED CURRENT
     * ===================================================== */

    /* RED LED */
    if (!MAX30102_WriteReg(
            REG_PULSE_AMP_1,
            LED_CURRENT))
    {
        return false;
    }


    /* IR LED */
    if (!MAX30102_WriteReg(
            REG_PULSE_AMP_2,
            LED_CURRENT))
    {
        return false;
    }


    /* =====================================================
     * 9. RESET INTERRUPT STATUS
     * ===================================================== */

    if (!MAX30102_ClearInterrupt())
    {
        return false;
    }


    /* =====================================================
     * 10. START SPO2 MODE
     *
     * RED + IR
     * ===================================================== */

    if (!MAX30102_WriteReg(
            REG_MODE_CONFIG,
            MODE_SP02))
    {
        return false;
    }


    /* =====================================================
     * 11. ENABLE INTERRUPT
     * ===================================================== */

    configValue =
        PPG_RDY_EN |
        A_FULL_EN;


    if (!MAX30102_WriteReg(
            REG_INTER_ENABLE_1,
            configValue))
    {
        return false;
    }


    /*
     * Không dùng interrupt ở Status 2.
     */
    if (!MAX30102_WriteReg(
            REG_INTER_ENABLE_2,
            0x00))
    {
        return false;
    }


    return true;
}


/* =========================================================
 * CLEAR INTERRUPT
 * ========================================================= */

bool MAX30102_ClearInterrupt(void)
{
    uint8_t status1 = 0;
    uint8_t status2 = 0;


    if (!MAX30102_ReadReg(
            REG_INTER_STATUS_1,
            &status1))
    {
        return false;
    }


    return MAX30102_ReadReg(
        REG_INTER_STATUS_2,
        &status2
    );
}


/* =========================================================
 * CHECK INT PIN
 * ========================================================= */

bool MAX30102_HasInterrupt(void)
{
    return (
        digitalRead(INT_PIN) == LOW
    );
}


/* =========================================================
 * READ ONE FIFO SAMPLE
 *
 * SPO2 Mode:
 *
 * RED = 3 byte
 * IR  = 3 byte
 *
 * Total = 6 byte
 * ========================================================= */

bool MAX30102_ReadFIFO(
    uint32_t *redLED,
    uint32_t *irLED
)
{
    if (
        redLED == nullptr ||
        irLED == nullptr
    )
    {
        return false;
    }


    uint8_t wrPtr = 0;
    uint8_t rdPtr = 0;


    /* =====================================================
     * READ WRITE POINTER
     * ===================================================== */

    if (!MAX30102_ReadReg(
            REG_WR_PTR_CONF,
            &wrPtr))
    {
        return false;
    }


    /* =====================================================
     * READ READ POINTER
     * ===================================================== */

    if (!MAX30102_ReadReg(
            REG_RD_PTR_CONF,
            &rdPtr))
    {
        return false;
    }


    /*
     * Pointer là 5-bit.
     */
    wrPtr &= 0x1F;
    rdPtr &= 0x1F;


    /*
     * FIFO không còn dữ liệu.
     */
    if (wrPtr == rdPtr)
    {
        return false;
    }


    /* =====================================================
     * CHỌN FIFO DATA REGISTER
     * ===================================================== */

    Wire.beginTransmission(MAX30102_ADDR_REG);

    Wire.write(REG_FIFO_DATA);


    /*
     * Ở FIFO burst read, dùng STOP sau khi
     * chọn FIFO_DATA.
     *
     * SparkFun cũng sử dụng kiểu này khi
     * đọc FIFO.
     */
    if (Wire.endTransmission() != 0)
    {
        return false;
    }


    /* =====================================================
     * READ 6 BYTES
     * ===================================================== */

    size_t received =
        Wire.requestFrom(
            (uint8_t)MAX30102_ADDR_REG,
            (size_t)6,
            true
        );


    if (received != 6)
    {
        return false;
    }


    uint8_t data[6];


    for (uint8_t i = 0; i < 6; i++)
    {
        if (!Wire.available())
        {
            return false;
        }


        data[i] = Wire.read();
    }


    /* =====================================================
     * RED
     * ===================================================== */

    *redLED =
        (
            ((uint32_t)data[0] << 16) |
            ((uint32_t)data[1] << 8)  |
            ((uint32_t)data[2])
        )
        & 0x03FFFF;


    /* =====================================================
     * IR
     * ===================================================== */

    *irLED =
        (
            ((uint32_t)data[3] << 16) |
            ((uint32_t)data[4] << 8)  |
            ((uint32_t)data[5])
        )
        & 0x03FFFF;


    return true;
}


/* =========================================================
 * FIFO OVERFLOW COUNTER
 * ========================================================= */

uint8_t MAX30102_GetOverflowCounter(void)
{
    uint8_t overflow = 0;


    if (!MAX30102_ReadReg(
            REG_OVF_COUNTER,
            &overflow))
    {
        return 0;
    }


    return overflow & 0x1F;
}


/* =========================================================
 * ISR
 *
 * ISR VẪN NẰM TRONG LIB.
 * ========================================================= */

