Foxcy2611/NCKH_2026_AIOT/AIOT_2026/src/ESP32_MAX30102_Lib.cpp
void IRAM_ATTR MAX30102_ISR(void)
{
    /*
     * ISR chỉ set flag.
     *
     * Không Wire.
     * Không Serial.
     * Không delay.
     */
    MAX30102_is_ready = true;
}


/* =========================================================
 * TEST SETUP
 *
 * VẪN NẰM TRONG LIB.
 * ========================================================= */

void MAX30102_TestSetup(void)
{
    Serial.begin(115200);


    delay(500);


    Serial.println();
    Serial.println(
        "--- MAX30102 Hardware Interrupt Test ---"
    );


    Serial.printf(
        "[INFO] SDA=%d | SCL=%d | INT=%d\n",
        SDA_PIN,
        SCL_PIN,
        INT_PIN
    );


    /* =====================================================
     * I2C INIT
     * ===================================================== */

    Wire.begin(
        SDA_PIN,
        SCL_PIN
    );


    /*
     * Tạm dùng 100 kHz để debug.
     *
     * Khi chạy ổn có thể đổi lại:
     *
     * Wire.setClock(400000);
     */
    Wire.setClock(100000);


    delay(100);


    /* =====================================================
     * TEST I2C ADDRESS 0x57
     * ===================================================== */

    uint8_t pingError =
        MAX30102_I2CPing();


    if (pingError != 0)
    {
        Serial.printf(
            "[ERR] Khong tim thay I2C device tai 0x57! Error=%u\n",
            pingError
        );


        Serial.println(
            "[ERR] Kiem tra lai VCC, GND, SDA=21, SCL=22."
        );


        while (1)
        {
            delay(1000);
        }
    }


    Serial.println(
        "[OK] I2C device 0x57 ACK."
    );


    /* =====================================================
     * INIT MAX30102
     * ===================================================== */

    if (!MAX30102_Init())
    {
        Serial.println(
            "[ERR] Khoi tao MAX30102 that bai!"
        );


        while (1)
        {
            delay(1000);
        }
    }


    Serial.println(
        "[OK] Khoi tao MAX30102 thanh cong!"
    );


    /* =====================================================
     * ATTACH INTERRUPT
     * ===================================================== */

    attachInterrupt(
        digitalPinToInterrupt(INT_PIN),
        MAX30102_ISR,
        FALLING
    );


    /*
     * Tránh trường hợp INT đã LOW
     * trước khi attachInterrupt().
     *
     * Clear trạng thái cũ để INT về HIGH,
     * sample tiếp theo sẽ tạo FALLING mới.
     */
    if (!MAX30102_ClearInterrupt())
    {
        detachInterrupt(digitalPinToInterrupt(INT_PIN));
        Serial.println("[ERR] Clear interrupt failed!");
        return;
    }

    MAX30102_is_ready = false;


    Serial.println(
        "[OK] Interrupt attached!"
    );


    Serial.println(
        "RED,IR"
    );
}


/* =========================================================
 * TEST LOOP
 *
 * VẪN NẰM TRONG LIB.
 * ========================================================= */

void MAX30102_TestLoop(void)
{
    int32_t heartRate = -999;
    int8_t validHeartRate = 0;

    int32_t spo2 = -999;
    int8_t validSpO2 = 0;
    bool fingerDetected = false;


    bool success = MAX30102_GetHeartRateSpO2(
        &heartRate,
        &validHeartRate,
        &spo2,
        &validSpO2,
        &fingerDetected
    );


    Serial.println(
        "--------------------------"
    );


    if (!success)
    {
        Serial.println(
            fingerDetected
                ? "Dang thu thap du lieu..."
                : "Khong phat hien ngon tay"
        );
        return;
    }


    Serial.print("Heart Rate: ");

    if (validHeartRate)
    {
        Serial.print(heartRate);
        Serial.println(" BPM");
    }
    else
    {
        Serial.println("Invalid");
    }


    Serial.print("SpO2      : ");

    if (validSpO2)
    {
        Serial.print(spo2);
        Serial.println(" %");
    }
    else
    {
        Serial.println("Invalid");
    }
}

bool MAX30102_GetHeartRateSpO2(
    int32_t *heartRate,
    int8_t *validHeartRate,
    int32_t *spo2,
    int8_t *validSpO2,
    bool *fingerDetected
)
{
    if (
        heartRate == nullptr ||
        validHeartRate == nullptr ||
        spo2 == nullptr ||
        validSpO2 == nullptr ||
        fingerDetected == nullptr
    )
    {
        return false;
    }

#if SENSOR_TIMING_DEBUG
    MAX30102_timingProfile = {};
#endif

    *heartRate = -999;
    *validHeartRate = 0;
    *spo2 = -999;
    *validSpO2 = 0;
    *fingerDetected = true;

    int32_t calculatedHeartRate = -999;
    int8_t calculatedValidHeartRate = 0;
    int32_t calculatedSpO2 = -999;
    int8_t calculatedValidSpO2 = 0;
    uint32_t red;
    uint32_t ir;


    /* =========================================
     * LẦN ĐẦU: THU 100 MẪU
     * ========================================= */
    if (!MAX30102_bufferReady)
    {
#if SENSOR_TIMING_DEBUG
        int64_t initialSampleStartUs = esp_timer_get_time();
#endif
        uint16_t index = 0;
        uint32_t waitStart = millis();


        while (index < MAX30102_BUFFER_SIZE)
        {
            /*
             * Chờ interrupt báo có dữ liệu.
             */
            if (!MAX30102_is_ready)
            {
                if ((millis() - waitStart) >= MAX30102_SAMPLE_TIMEOUT_MS)
                {
                    return false;
                }


                delay(1);
                continue;
            }


#if SENSOR_TIMING_DEBUG
            int64_t mutexWaitStartUs = esp_timer_get_time();
#endif
            if (!MAX30102_LockI2C())
            {
                return false;
            }
#if SENSOR_TIMING_DEBUG
            MAX30102_timingProfile.mutexWaitUs +=
                esp_timer_get_time() - mutexWaitStartUs;
            int64_t fifoStartUs = esp_timer_get_time();
#endif


            MAX30102_is_ready = false;

            if (!MAX30102_ClearInterrupt())
            {
                MAX30102_UnlockI2C();
                return false;
            }


            /*
             * Đọc hết sample hiện có trong FIFO.
             */
            while (
                MAX30102_ReadFIFO(&red, &ir) &&
                index < MAX30102_BUFFER_SIZE
            )
            {
                if (!MAX30102_IsFingerDetected(ir))
                {
                    *fingerDetected = false;
                    MAX30102_bufferReady = false;
                    MAX30102_UnlockI2C();
                    return false;
                }

                MAX30102_redBuffer[index] = red;
                MAX30102_irBuffer[index]  = ir;

                index++;
            }


            MAX30102_UnlockI2C();
#if SENSOR_TIMING_DEBUG
            MAX30102_timingProfile.fifoUs +=
                esp_timer_get_time() - fifoStartUs;
#endif
        }


        MAX30102_bufferReady = true;
#if DEBUG_MAX30102_PEAK
        MAX30102_debugSession++;
        MAX30102_debugSessionWindow = 0;
#endif
#if SENSOR_TIMING_DEBUG
        MAX30102_timingProfile.sampleUs +=
            esp_timer_get_time() - initialSampleStartUs;
#endif
    }


    /* =========================================
     * TÍNH HR + SPO2
     * ========================================= */
    maxim_heart_rate_and_oxygen_saturation(
        MAX30102_irBuffer,
        MAX30102_BUFFER_SIZE,

        MAX30102_redBuffer,

