Foxcy2611/NCKH_2026_AIOT/AIOT_2026/src/ESP32_MAX30102_Lib.cpp
        &calculatedSpO2,
        &calculatedValidSpO2,

        &calculatedHeartRate,
        &calculatedValidHeartRate
    );

    MAX30102_ApplyPhysiologicalSanityCheck(
        &calculatedHeartRate,
        &calculatedValidHeartRate,
        &calculatedSpO2,
        &calculatedValidSpO2
    );


    /* =========================================
     * GIỮ LẠI 75 MẪU CŨ
     * ========================================= */
    for (
        uint16_t i = MAX30102_NEW_SAMPLES;
        i < MAX30102_BUFFER_SIZE;
        i++
    )
    {
        MAX30102_redBuffer[
            i - MAX30102_NEW_SAMPLES
        ] = MAX30102_redBuffer[i];


        MAX30102_irBuffer[
            i - MAX30102_NEW_SAMPLES
        ] = MAX30102_irBuffer[i];
    }


    /* =========================================
     * THU THÊM 25 MẪU MỚI
     * ========================================= */
    uint16_t index =
        MAX30102_BUFFER_SIZE -
        MAX30102_NEW_SAMPLES;
    uint32_t waitStart = millis();
#if SENSOR_TIMING_DEBUG
    int64_t newSampleStartUs = esp_timer_get_time();
#endif


    while (index < MAX30102_BUFFER_SIZE)
    {
        if (!MAX30102_is_ready)
        {
            if ((millis() - waitStart) >= MAX30102_SAMPLE_TIMEOUT_MS)
            {
                MAX30102_bufferReady = false;
                return false;
            }


            delay(1);
            continue;
        }


#if SENSOR_TIMING_DEBUG
        int64_t mutexWaitStartUs = esp_timer_get_time();
#endif
        if (!MAX30102_LockI2C())
        {
            MAX30102_bufferReady = false;
            return false;
        }
#if SENSOR_TIMING_DEBUG
        MAX30102_timingProfile.mutexWaitUs +=
            esp_timer_get_time() - mutexWaitStartUs;
        int64_t fifoStartUs = esp_timer_get_time();
#endif


        MAX30102_is_ready = false;

        if (!MAX30102_ClearInterrupt())
        {
            MAX30102_UnlockI2C();
            MAX30102_bufferReady = false;
            return false;
        }


        while (
            MAX30102_ReadFIFO(&red, &ir) &&
            index < MAX30102_BUFFER_SIZE
        )
        {
            if (!MAX30102_IsFingerDetected(ir))
            {
                *fingerDetected = false;
                MAX30102_bufferReady = false;
                MAX30102_UnlockI2C();
                return false;
            }

            MAX30102_redBuffer[index] = red;
            MAX30102_irBuffer[index]  = ir;

            index++;
        }


        MAX30102_UnlockI2C();
#if SENSOR_TIMING_DEBUG
        MAX30102_timingProfile.fifoUs +=
            esp_timer_get_time() - fifoStartUs;
#endif
    }

#if SENSOR_TIMING_DEBUG
    MAX30102_timingProfile.sampleUs +=
        esp_timer_get_time() - newSampleStartUs;
#endif


    *heartRate = calculatedHeartRate;
    *validHeartRate = calculatedValidHeartRate;
    *spo2 = calculatedSpO2;
    *validSpO2 = calculatedValidSpO2;

    return true;
}
